
#pyinstaller -F -w --hidden-import=queue main.py




questions = {"0":"以下为卡特尔16种性格因素测验的测试题。本测试包括一些有关个人生活情形的问题，每个人对这些问题会有不同的看法，每个人的回答也就自然会有所不同。因而对问题如何回答，不存在“对”与“不对”之分，只是表明您对这些问题的态度。请您尽量表达您个人的意见，不要有所顾忌。（测验题）每一个问题都有三个被选项，但您对每个问题只能选择一个项目。请尽量少选中性答案。每个问题都要回答。务必请您根据自己的实际情况回答。对每个问题不要过多考虑，请尽快回答。",
             "1":"1.我很明了本测试的说明：","2":"2.我对本测试的每一个问题，都能做到诚实地回答：","3":"3.如果我有机会的话，我愿意：","4":"4.我有能力应付各种困难：","5":"5.即使是关在铁笼里的猛兽，我见了也会感到惴惴不安：","6":"6.我总是不敢大胆批评别人的言行：","7":"7.我的思想似乎：","8":"8.我不擅长说笑话，讲有趣的事：","9":"9．当我见到邻居或新友争吵时，我总是：","10":"10.在群众集会时，我：",
             "11":"11.我愿意作一个：","12":"12.阅读时，我喜欢选读：","13":"13.我认为很多人都有些心里不正常，只是他们不愿承认：","14":"14.我希望我的爱人擅长交际，无须具有文艺才能：","15":"15.对于性情急躁，`爱发脾气的人，我仍能以礼相待","16":"16.受人侍奉时我常常局促不安：","17":"17.在从事体力或脑力劳动之后，我总是需要比别人更多的休息时间，才能保持工作效率：","18":"18.半夜醒来，我常常为种种不安而不能入睡：","19":"19.事情进行的不顺利时，我常常急得涕泪交流：","20":"20.我以为只要双方同意可离婚，可以不受传统观念的束缚：",
             "21":"21.我对人或物的兴趣都很容易改变：","22":"22.工作中，我愿意：","23":"23.我常常无缘无故的自言自语：","24":"24.无论是工作，饮食或外出游览，我总是：","25":"25.又时我怀疑别人是否对我的言行真正有兴趣：","26":"26.如果我在工厂里工作，我愿做","27":"27.在阅读时我愿阅读：","28":"28.本题后面列出三个单词，那个与其他两个单词不同类","29":"29.如果我能到一个新的环境，我要：","30":"30.在一生中，我总觉得我能达到我所预期的目标：",
             "31":"31.当我说谎时总觉得内心羞愧不敢正视对方：","32":"32.假使我手里拿着一颗装着子弹的手枪，我必须把子弹拿出来才能安心：","33":"33.多数人认为我是一个说话风趣的人：","34":"34.如果人们知道我内心的成见，他们会大吃一惊：","35":"35.在公共场合，如果我突然成为大家注意的中心，就会感到局促不安","36":"36.我总喜欢参加规模庞大的晚会或集会：","37":"37.在学科中，我喜欢：","38":"38.我常常怀疑那些出乎我意料的对我过于友善的人的动机是否诚实","39":"39.我愿意把我的生活安排得像一个：","40":"40.我认为目前所需要的是：",
            "41":"41.有时候我觉得我需要剧烈的体力劳动：","42":"42.我愿意跟有教养的人来往而不愿意同粗鲁的人交往：","43":"43.在处理一些必须凭借智慧的事务中：","44":"44当领导召见我时，我：","45":"45.如果待遇优厚，我愿意做护理精神病人的工作：","46":"46.读报时，我喜欢读：","47":"47.在接受困难任务时，我总是：","48":"48.在游览时，我宁愿观看一个画家的写生，也不愿听大家的辩论：","49":"49.我的神经脆弱，稍有点刺激就会战栗：","50":"50.早晨起来，常常感到疲乏不堪：",
            "51":"51.如果待遇相同，我愿选做：","52":"52.每逢过年过节或亲友结婚时，我：","53":"53.本题后列有三个数字，那个数字与其他两个数字不同类：","54":"54.猫和鱼就像牛和：","55":"55.我在小学时敬佩的老师，到现在仍然值得我敬佩：","56":"56.我觉得我确实有一些别人所不及的优良品质：","57":"57.根据我的能力，即使让我做一些平凡的工作，我也会安心的：","58":"58.我喜欢看电影或参加其他娱乐活动的次数：","59":"59.我喜欢从事需要精密技术的工作：","60":"60.在有威望有地位的人面前，我总是较为居促谨慎：",
            "61":"61.对于我来说在大众面前眼见或表演，是一件难事：","62":"62.我愿意：","63":"63.即使我做了一件让别人笑话的事，我也能坦然处之：","64":"64.我认为没有人会幸灾乐祸的希望我遇到困难：","65":"65.一个成熟的人应该考虑人生的真正意义：","66":"66.我喜欢处理被人弄得一塌糊涂的工作：","67":"67.当我非常高兴时，总有一种“好景不长”的感受：","68":"68.在一般困难情境中，我总能保持乐观：","69":"69.迁居是一件极不愉快的事：","70":"70.在年轻的时候，当我和父母的意见不同时：",
            "71":"71.我希望把我的家庭：","72":"72.我解决问题时，多借助于：","73":"73.在需要当机立断时，我总是：","74":"74.最近在一两件事情上，我觉得我是无辜受累的：","75":"75.我善于控制我的表情：","76":"76.如果待遇相同，我愿做一个：","77":"77.以“惊讶”与“新奇”搭配为例，认为“惧怕”与（  ）搭配：","78":"78.本题后面列出三个分数，哪一个数与其他两个分数不同类：","79":"79.不知为什么，有些人总是回避或冷淡我：","80":"80.我虽然好意待人，但常常得不到好报：",
            "81":"81.我不喜欢争强好胜的人：","82":"82.和一般人相比，我的朋友的确太少：","83":"83.不在万不得已的情况下，我总是回避参加应酬性的活动：","84":"84.我认为对领导逢迎得当比工作表现更重要：","85":"85.参加竞赛时，我总是着重在竞赛的活动，而不计较其成败：","86":"86.按照我个人的意愿，我希望做的工作是：","87":"87.我愿意阅读：","88":"88.我认为有许多人之所以不敢犯罪，其主要原因是怕被惩罚：","89":"89.我的父母从来不严格要求我事事顺从：","90":"90.“百折不挠，再接再厉”的精神常常被人们所忽略：",
            "91":"91.当有人对我发火时，我总是：","92":"92.我希望人们都要友好相处：","93":"93.不论是在极高的屋顶上，还是在极深的隧道中，我很少感到胆怯不安：","94":"94.只要没有过错，不管别人怎么说，我总能心安理得：","95":"95.我认为凡是无法用理智来解决的问题，有时就不得不靠强权处理：","96":"96.我在年轻的时候，和异性朋友交往：","97":"97.我在社团活动中，是一个活跃分子：","98":"98.在人声嘈杂中，我仍能不受干扰，专心工作：","99":"99.在某些心境下，我常常因为困惑陷入空想而将工作搁置下来：","100":"100.我很少用难堪的语言去刺伤别人的感情：",
            "101":"101.如果让我选择，我宁愿选做：","102":"102.“理不胜词”的意思是：","103":"103.以“铁锹”与“挖掘”搭配为例，我认为“刀子”与（    ）搭配：","104":"104.我在大街上，常常避开我所不愿意打招呼的人：","105":"105.当我聚精会神的听音乐时，假使有人在旁边高谈阔论：","106":"106.在课堂上，如果我的意见与老师不同，我常常：","107":"107.我单独跟异性谈话时，总显得不自然：","108":"108.我在待人接物方面，的确不太成功：","109":"109每当作一件困难工作时，我总是：","110":"110在我结交朋友中，男女各占一半：",
            "111":"111．我在结交朋友方面： ","112":"112.我愿意作一个社会科学家，而不愿作一个机械工程师：","113":"113.如果我发现别人的缺点，我常常不顾一切的提出指责：","114":"114.我喜欢设法影响和我一起工作的同志，是他们能协助我所计划的目的：","115":"115.我喜欢做音乐，或跳舞，或新闻采访等工作：","116":"116.当人们表扬我的时候，我总觉得羞愧窘促：","117":"117.我认为一个国家最需要解决的问题是：","118":"118.有时我会无故的产生一种面临大祸的恐惧：","119":"119.我在童年时，害怕黑暗的次数：","120":"120.在闲暇的时候，我喜欢：",
            "121":"121.当人们批评我古怪不正常时，我：","122":"122.当来到一个新城市里找地址时，我常常：","123":"123.当朋友声明她要在家休息时，我总是设法怂恿她同我一起到外面去玩：","124":"124.在就寝时，我常常：","125":"125.有人烦扰我时，我：","126":"126.如果待遇相同，我愿做一个：","127":"127.“时间变成了永恒”这是比喻：","128":"128.本题后的哪一项应接在“╳0000╳╳00╳╳╳”的后面","129":"129.我不论到什么地方，都能清楚的辨别方向：","130":"130.我热爱我所学的专业和所从事的工作：",
            "131":"131.如果我急于想借朋友的东西，而朋友又不在家时，我认为不告而取也没有关系：","132":"132.我喜欢给朋友讲述一些我个人有趣的经历：","133":"133.我宁愿做一个：","134":"134.业余时间，我总是做好安排，不使时间浪费：","135":"135.在和别人交往中，我常常会无缘无故的产生一种自卑感：","136":"136.和不熟识的人交谈，对我来说：","137":"137.我所喜欢的音乐是：","138":"138.我爱想入非非：","139":"139.我认为未来二十年的世界局势，定将好转：","140":"140.在童年时，我喜欢阅读：",
            "141":"141.我向来对机械，汽车等发生兴趣","142":"142.即使让我做一个缓刑释放的罪犯的管理人，我也会把工作搞得很好：","143":"143.我仅仅被认为是一个能够苦干而稍有成就的人而已","144":"144.就是在不顺利的情况下，我仍能保持精神振奋：","145":"145.我认为节制生育是解决经济与和平问题的重要条件：","146":"146.在工作中，我喜欢独自筹划，不愿受别人干涉：","147":"147.尽管有的同志和我的意见不和，但仍能跟她搞好团结：","148":"148.我在工作和学习上，总是使自己不粗心大意，不忽略细节：","149":"149.在和人争辩或险遭事故后，我常常表现出震颤，筋疲力尽，不能安心工作：","150":"150.未经医生处方，我是从不乱吃药的：",
            "151":"151.根据我个人的兴趣，我愿意参加：","152":"152.以星火与燎原搭配为例，我认为姑息与（    ）搭配：","153":"153.“钟表”与“时间”的关系犹如“裁缝”与（     ）的关系：","154":"154.生动的梦境，常常干扰我的睡眠：","155":"155.我爱打抱不平：","156":"156.如果我要到一个新城市，我将要：","157":"157.我爱穿朴素的衣服，不愿穿华丽的服装：","158":"158.我认为安静的娱乐远远胜过热闹的宴会：","159":"159.我明知自己有缺点，但不愿接受别人的批评：","160":"160.我总是把“是，非，善，恶”作为处理问题的原则：",
            "161":"161.当我工作时，我不喜欢有人许多人在旁边参观：","162":"162.我认为，侮辱那些即使有错误但有文化教养的人，如医生，教师等也是不应该的：","163":"163.在各种课程中，我喜欢：","164":"164.那些自以为是，道貌岸然的人使我生气：","165":"165.和循规蹈矩的人交谈：","166":"166.我喜欢：","167":"167.如果征求我的意见，我赞同：","168":"168.有时我会无缘无故的感到沮丧，痛哭：","169":"169.当和立场相反的人争辩时，我主张：","170":"170.我一向重感情而不重理智，因而我的观点常常动摇不定：",
            "171":"171.我的学习多赖于：","172":"172.我宁愿选择一个工资较高的工作，不在乎是否有保障，而不愿做工资低固定工作","173":"173.在参加讨论时，我总是能把握自己的立场：","174":"174.我常常被一些无所谓的小事所烦扰：","175":"175.我宁愿住在嘈杂的闹市区，而不愿住在僻静的地区：","176":"176.下列工作如果任我挑选的话，我愿做：","177":"177.一人（    ）事，人人受累：","178":"178.望子成龙的家长往往（      ）苗助长：","179":"179.气候的变化并不影响我的情绪：","180":"180．因为我对一切问题都有一些见解，所以大家都认为我是一个有头脑的人：",
            "181":"181.我讲话的声音：","182":"182.一般人都认为我是一个活跃热情的人：","183":"183.我喜欢做出差机会较多的工作：","184":"184.我做事严格，力求把事情办得尽善尽美：","185":"185.在取回或归还所借的东西时，我总是仔细检查，看是否保持原样：","186":"186.我通常是精力充沛，忙碌多事：","187":"187.我确信我没有遗漏或漫不经心回答上面的任何问题："}

answers = [[0],["是的","不一定","不是的"],["是的","不一定","不同意"],["到一个繁华的城市去旅行","介于（A）,(C)之间","浏览清静的山区"],["是的","不一定","不是的"],["是的","不一定","不是的"],["是的","有时如此","不是的"],["比较先进","一般","比较保守"],["是的","介于（A）,(C)之间","不是的"],["任其自己解决","介于（A）,(C)之间","予以劝解"],["谈吐自如","介于（A）,(C)之间","保持沉默"],
           ["建筑工程师","不确定","社会科学研究者"],["自然科学书籍","不确定","政治理论书籍"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["常常如此","有时如此","极少如此"],["常常如此","有时如此","极少如此"],
           ["是的","介于（A）,(C)之间","不是的"],["和别人合作","不确定","自己单独进行"],["常常如此","偶尔如此 ","从不如此"],["匆匆忙忙不能尽兴 ","介于（A）,(C)之间","从容不迫"],["是的","介于（A）,(C)之间","不是的"],["技术科的工作","介于（A）,(C)之间","宣传科的工作"],["有关太空旅行的书籍","不太确定 ","有关家庭教育的书籍"],["狗","石头 ","牛"],["把生活安排的和从前不一样","不确定","和从前一样"],["是的","不一定","不是的"],
           ["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["音乐","不一定","手工劳动"],["是的","介于（A）,(C)之间","不是的"],["艺术家","不确定 ","会计师"],["多出现一些改造世界的理想家","不确定 ","脚踏实地的实干家"],
           ["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["我的亲人表现的比一般人差","普通","我的亲人表现的超人一等"],["觉得可以趁机提出建议 ","介于（A）,(C)之间","总怀疑自己做错事"],["是的","介于（A）,(C)之间","不是的"],["当今世界的基本问题","介于（A）,(C)之间","地方新闻"],["有独立完成的信心","不确定","望有别人帮助和指导"],["是的","不一定","不是的"],["时常如此 ","有时如此","从不如此"],["是的","介于（A）,(C)之间","不是的"],
           ["森林管理员 ","不一定 ","中小学教员"],["喜欢赠送礼品","不太确定","不愿相互送礼"],["5 ","2 ","7"],["牛奶 ","木材","盐"],["是的","不一定","不是的"],["是的","不一定","不是的"],["是的","不一定","不是的"],["比一般人多","和一般人相同","比一般人少"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],
           ["是的","介于（A）,(C)之间","不是的"],["指挥几个人工作","不确定","和同志们一起工作"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["保留自己的意见","介于（A）,(C)之间","接受父母的意见"],
           ["建设成适合自身活动和娱乐的地方","介于（A）,(C)之间","成为邻里交往活动的一部分"],["个人独立思考","介于（A）,(C)之间","和别人互相讨论"],["镇静地运用理智","介于（A）,(C)之间","常常紧张兴奋"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["化学研究工作者","不确定 ","旅行社经理"],["勇敢","焦虑","恐怖"],["3/7 ","3/9","3/11"],["是的","不一定","不是的"],["是的","不一定","不是的"],
           ["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["总是如此","一般如此","偶然如此"],["有固定而可靠的工资收入","介于（A）,(C)之间","工资高低应随我的工作表现而随时调整"],["军事与政治的实事记载","不一定","富有情感的幻想的作品"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","不一定","不是的"],
           ["设法使他镇静下来 ","不太确定 ","自己也会发起火来"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["较多","介于（A）,(C)之间","较别人少"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不太确定","不是的"],
           ["列车员","不确定","描图员"],["理不如词","理多而词少","词藻华丽而理不足"],["琢磨","切割","铲除"],["极不如此","偶然如此","有时如此"],["我仍能专心听音乐","介于（A）,(C)之间","不能专心而感到恼怒"],["保持沉默","不一定","表明自己的看法"],["是的","介于（A）,(C)之间","不是的"],["是的","不完全这样","不是的"],["预先做好准备","介于（A）,（C）之间","相信到时候总会有办法解决的"],["是的","介于（A）,(C)之间","不是的"],
           ["结识很多的人","不一定 ","维持几个深交的朋友"],["是的","不太确定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","介于（A）,(C)之间","不是的"],["政治问题","不太确定 ","道德问题"],["是的","有时如此 ","不是的"],["很多","不太多","几乎没有"],["看一部历史性的探险小说","不一定","读一本科学性的幻想小说"],
           ["非常气恼","有些气恼","无所谓"],["找人问路","介于（A）,(C)之间","参考地图"],["是的","不一定","不是的"],["不易入睡 ","介于（A）,(C)之间 ","极易入睡"],["能不露声色","介于（A）,(C)之间 ","总要说给别人听，以泄愤怒"],["律师","不确定 ","航海员"],["时间过得快","忘了时间","光阴一去不复返"],["╳0╳","00╳","0╳╳ "],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],
           ["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["演员","不确定","建筑师"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["毫不困难","介于（A）,(C)之间","是一件难事"],["轻松活泼的","介于（A）,(C)之间","富有感情的"],["是的","不一定","不是的"],["是的","不一定","不是的"],["神话幻想故事","不确定 ","战争故事"],
           ["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不太确定","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],
           ["摄影组织活动","不确定 ","文娱队活动"],["同情","养奸","纵容"],["服装","剪刀","布料"],["经常如此","偶然如此 ","从不如此"],["是的","介于（A）,(C)之间","不是的"],["到处闲逛","不确定","避免去不安全的地方"],["是的","不太确定","不是的"],["是的","不太确定","不是的"],["偶然如此","极少如此","从不如此"],["是的","介于（A）,(C)之间","不是的"],
           ["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["语文 ","不确定","数学"],["是的","介于（A）,(C)之间","不是的"],["很有兴趣，并有所获的","介于（A）,(C)之间","他们的思想简单，使我太厌烦"],["有几个有时对我很苛求但富有感情的朋友","介于（A）,(C)之间","不受别人的干扰"],["切实制止精神病患者和智能低下的人生育","不确定","杀人犯必须判处死刑"],["是的","介于（A）,(C)之间","不是的"],["尽量找出基本概念的差异","不一定 ","彼此让步"],["是的","不一定","不是的"],
           ["阅读书刊","介于（A）,（C）之间","参加集体讨论"],["是的","不一定","不是的"],["经常如此","一般如此","必要时才如此"],["是的","介于（A）,(C)之间","不是的"],["是的","不太确定","不是的"],["少先队辅导员","不太确定","修表工作"],["偾 ","愤","喷"],["揠","堰","偃"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],
           ["洪亮","介于（A）,(C)之间","低沉"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","介于（A）,(C)之间","不是的"],["是的","不一定","不是的"],["是的","不确定","不是的"]]

characterdiscreption = [["低乐群性：内向，孤独，冷漠。标准分低于3者通常固执，对人冷漠，落落寡合，喜欢吹毛求疵，宁愿独自工作，对事而不对人，不轻易放弃自己的主见，为人做事的标准常常很高。严谨而不苟且。物理学家和电机工程师则多系低A，（低A者）则必须极端的冷静严肃与正确才能圆满地完成任务。",
                         "高乐群性：外向，热情，乐群。标准分高过8者，通常和蔼可亲，与人相处，合作与适应的能力特强。喜欢和别人共同工作，参加或组织各种社团活动，不斤斤计较，容易接受别人的批评。萍水相逢也可以一见如故。教师和推销员多系高A，（高A者）需要时时应付人与人之间的复杂情绪或行为问题，而仍然能够保证其乐观的态度。"],
                        ["低智慧性：思想迟钝，学识浅薄，抽象思考能力弱。低者通常对学习与了解能力不强，不能“举一隅而以三隅反”。迟钝的原因可能由于情绪不稳定，心理病态或失常所致。从事例行职务的人如大资源，电话生，家庭主妇。",
                         "高智慧性：聪明，富有才识，善于抽象思考。高者通常学习能力强，思考敏捷正确，教育，文化水准高，个人心身状态健康。机警者多有高B，高B反映心理机能的正常。专业训练需要高B。"],
                        ["低稳定性：情绪激动，易生烦恼。低者通常不能以“逆来顺受”的态度，应付生活上所遭遇的阻扰和挫折，容易受环境的支配，而心神动摇不定。不能面对现实，时时会暴躁不安，心身疲乏，甚至于失眠，噩梦，恐怖等症象。所有神经病人和精神病人都属低C。凡能随心所欲，安排自己工作进度的人，如作家，邮差或清道工等，则虽系低C，尚无大碍。",
                         "高稳定性：情绪稳定而成熟，能面对现实。高者通常以沉着的态度应付现实各项问题。行动充满魄力。能振奋勇气，维持团队的精神。有时高C也可能由于不能彻底解决许多生活难题，而不得不自我宽解。教师，机器工程师，推销员，救火队队员等，凡需要应付日常生活各种难题者应有高C。"],
                        ["低影响性：谦逊，顺从，通融，恭顺。低者通常行为温顺，迎合别人的意旨，也可能因为希望可遇而不可求，即使处在十全十美的境地，而有“事事不如人”之感，许多精神病人都有这样消极的心情。",
                         "高影响性：好强固执，独立积极。高者通常自视甚高，自以为是。可能非常地武断，而时常驾驭不及他的人和反抗权势者。领袖以及有地位有成就的人多属高E。救火队员和航空飞行员的因素E高"],
                        ["低活泼性：严肃，谨慎，冷静，寡言。低者通常行动拘禁，内省而不轻易发言，较消极，忧郁。有时候可能过分深思熟虑，又近乎骄傲自满。在职责上，他常是认真而可靠的工作人员。实验技术人员则不必有高F",
                         "高活泼性：轻松，兴奋，随遇而安。高者通常活泼，愉快，健谈，对人对事热心而富有感情。但是有时也可能会冲动，以致行为变化莫测。行政主管人员多有高F。竞选人必有高F,才能够获得选民的爱戴"],
                        ["低有恒性：苟且敷衍，缺乏奉公守法的精神。低者通常缺乏较高的目标和理想，对于人群及社会没有绝对的责任感，甚至于有时不惜执法犯法，不择手段已达到某一目的。但他常能有效的解决实际问题，而无须浪费时间和精力。任性纵欲，放火杀人的罪犯，因素G 极低。",
                         "高有恒性：持恒负责，做事尽职。高者通常细心周到，有始有终。是非善恶是他的行为指针。所结交的朋友多是努力苦干的人，而不十分欣赏诙谐有趣的人。各种社团组织的领袖需要高G。业务管理和警察具有极高的因素G。"],
                        ["低交际性：畏怯退缩，缺乏自信心。低者通常在人群中羞怯。有不自然的姿态，有强烈的自卑感。拙于发言，更不愿和陌生人交谈。凡是采取观望的态度，有时由于过分的自我意识而忽视了社会环境中的重要事物与活动。",
                         "高交际性：冒险敢为，少有顾忌。高者通常不掩饰，不畏缩，有敢做敢为的精神，使他能经历艰辛而保持刚毅的一例。有时可能太粗心大意，忽视细节，遭受无谓的打击与挫折。可能无聊多事，喜欢向异性殷勤卖力。救火队队员和飞行员有高H，团队领导人必具有高H。"],
                        ["低情感性：理智的，着重现实，自恃其力。低者唱常以客观，坚强，独立的态度处理当前的问题。重视文化修养，可能过分冷酷无情。工程师，外科医生，统计师等则多低I。",
                         "高情感性：敏感，感情用事。高者通常心肠软，易受感动，较女性化，爱好艺术，富于幻想。有时过分不切实际，缺乏耐心和恒心，不喜欢接近粗俗的人和做笨重的工作。在团体活动中，不着实际的看法与行为常常减低了团队的工作效率。室内设计师，音乐家，艺人，女人属高I。"],
                        ["低怀疑性：信赖随和，易与人相处。低者通常无猜忌，不与人角逐竞争，顺应合作，善于体贴人。在团体活动中，低L是以团体福利为前提的忠实分子。工程师，机工，精神病护理员多是低L。",
                         "高怀疑性：怀疑，刚愎，固执己见。高者通常怀疑，不信任别人，与人相处，常常斤斤计较，不顾及到别人的利益。在团体活动中，因素L过分高者常常成事不足，败事有余。行政人员和警察常是高L"],
                        ["低想象性：现实，合乎成规，力求妥善合力。低者通常先要斟酌现实条件，而后决定取舍，不鲁莽从事。在紧要关头时，也能保持镇静，有时可能过分重视现实，为人索然寡趣。低M多选择需要实际，机警，脚踏实地的工作。",
                         "高想象性：幻想的，狂放不羁。高者通常忽视生活的细节，只以本身的动机，当时兴趣等主观因素为行为的出发点。可能富有创造力，有时也过分不务实际，近乎冲动。因而容易被人误解及奚落。艺术家，作者及从事研究者多有高M。"],
                        ["低世故性：坦白，直率，天真。低者通常思想简单，感情用事。与人无争，与世无杵，自许，心满意足。但有时显得幼稚，粗鲁，笨拙，似乎缺乏教养。牧师神父，护士等多是低N，牧师的因素N不应太高，低N使他不苛求责难，能容忍同情信徒的缺点。",
                         "高世故性：精明，能干，世故。高者通常处事老练，行为得体。能冷静地分析一切，近乎狡猾。对于一切事物的看法是理智的，客观的。科学家，工程师，飞行员多是高N"],
                        ["低忧虑性：乐群，沉着，有自信心。低者通常有信心，不轻易动摇，信任自己有应付问题的能力，有安全感，能适应世俗。有时因为缺乏同情，而引发别人的反感与恶意。",
                         "高忧虑性：忧虑抑郁，烦恼自扰。高者通常觉得世道艰辛，人生不如意事常八九，甚至沮丧悲观，时时有患得患失之感。自觉不容于人，也缺乏和人接近的勇气。各种神经病和精神病人都有高O。年老的女招待，低级办事员，以及终生碌碌未尽如意的作家，编辑人等有高O。"],
                        ["低变革性：保守的，尊重传统观念与行为标准。低者通常无条件地接受社会中许多相沿已久而有权威性的见解，不愿常是探求新的境界。常常激烈的反对新思想以及一切新的变动。在政治与宗教信仰上，墨守成规，可能被称为老顽固或时代的落伍者。护士，牧师神父与许多为首高深教育的技工等则多有低Q1，神经病人的因素Q1也比较低。",
                         "高变革性：自由的，批评激进，不拘泥现实。高者通常喜欢考验一切现有的理论与实施，而予以新的评价，不轻易判断是非，企图了解较前卫的思想与行为。可能广见多闻。愿意充实自己的生活经验。行政主管人，前卫的政治家，科学家都必须具有高Q1"],
                        ["低独立性：依赖，随群，附和。低者通常宁欲与人共同工作，而不愿独立孤行。常常放弃个人的主见而附和取得别人的好感，需要团体的支持以维持其自信心，却并非真正的乐群者。低Q2者不能胜任需要随机应变能力的职务。",
                         "高独立性：自立自强，当机立断。高者通常能够自作主张，独自完成自己的工作计划，不依赖别人，也不受社会舆论的约束，同样也无意控制或支配别人，不嫌恶人，但是也不需要别人的好感。科学家，行政主管人等多有高Q2。"],
                        ["低自律性：矛盾冲突，不顾答题。低者通常既不能克制自己，又不能尊重礼俗，更不愿考虑别人的需要，充满矛盾却无法解决。生活适应有问题者多低Q3",
                         "高自律性：知己知彼，自律谨严。高者通常言行一致，能够合理的支配自己的感情行动。为人处世，总能保持其自尊心，赢得别人的尊重，有时却不免太固执己见。高Q3者多具有领袖能力的才干，主管人，电机工和生产部门的成功也需要高Q3。"],
                        ["低紧张性：心平气和，闲散宁静，低者通常知足常乐，内心平衡。也可能过分疏懒，缺乏进取心。",
                         "高紧张性：紧张闲扰，激动挣扎。高者通常缺乏耐心，心神不安，态度兴奋。时常感觉疲乏，又无法彻底摆脱以求宁静。在社群中，他对人与事都缺乏信心。每日生活战战兢兢，而不能自给。未能在生活或职业中发挥本身才智潜能的人多具有高Q4，如餐店招待，家庭主妇，缺乏生活保障的作业等。"]]
suitablejob = [["物理学家;电机工程师","教师;推销员"],["大资源;电话生;家庭主妇","擅长专业训练"],["作家;邮差;清道工","教师;机器工程师;推销员;救火队队员"],["","领袖;救火队员;航空飞行员"],["实验技术人员","行政主管;竞选人"],["放火杀人的罪犯","社团组织的领袖;业务管理;警察"],["","救火队队员;飞行员;领导人"],["工程师;外科医生;统计师","室内设计师;音乐家;艺人"],
               ["工程师;精神病护理员","行政人员;警察"],["需要实际机警脚踏实地的工作","艺术家;作者;研究者"],["牧师神父;护士","科学家;工程师;飞行员"],["","精神病人;年老的女招待;低级办事员"],["护士;牧师神父;神经病人","行政主管人;前卫的政治家;科学家"],["不能胜任需要随机应变能力的职务","科学家;行政主管人"],["生活适应有问题者","领袖;主管人;电机工"],["","未能在生活或职业中发挥本身才智潜能的人"],]
correctanswer = ["0","A","A","A","A","C","C","A","C","C","A","C","C","A","C","C","C","A","A","C","A",
                 "A","C","C","C","A","C","C","B","C","A","C","C","A","C","C","A","A","A","A","A",
                "C","A","A","C","C","A","A","A","A","A","C","A","B","B","A","A","C","A","A","C",
                 "C","C","C","C","A","C","C","C","A","A","A","A","A","A","C","C","C","B","C","C",
                 "C","C","C","C","C","C","C","A","C","C","A","C","C","C","C","C","C","A","A","A",
                 "A","C","B","A","A","C","A","A","A","A","A","A","A","A","A","A","A","A","A","C",
                 "C","C","C","A","C","A","C","B","A","A","A","A","A","A","C","A","C","A","C","A",
                 "C","A","A","C","A","A","A","A","A","A","C","B","C","C","A","A","C","C","C","A",
                 "C","C","A","A","C","C","A","A","A","C","A","C","A","A","C","A","A","A","A","A",
                 "A","A","A","A","A","A","A"]
characterkind = ["A ","B ","C ","E ","F ","G ","H ","I ","L ","M ","N ","O ","Q1 ","Q2 ","Q3 ","Q4 "]
characterkindd = ["乐群性","智慧性","稳定性","影响性","活泼性","有恒性","交际性","情感性","怀疑性","想象性","世故性","忧虑性","变革性","独立性","自律性","紧张性"]
characterindex = [[3,26,27,51,52,76,101,126,151,176],[28,53,54,77,78,102,103,127,128,152,153,177,178],[ 4,5,29, 30,55,79,80,104,105,129,130,154,179],[6,7,31,32,56,57,81,106,131,155,156,180,181],[8,33,58,82,83,107,108,132,133,157,158,182,183],[9,34,59,84,109,134,159,160,184,185],[10,35,36,60,61,85,86,110,111,135,136,161,186],[11,12,37,62,87,112,137,138,162,163],
                  [13,38,63,64,88,89,113,114,139,164],[14,15,39,40,65,90,91,115,116,140,141,165,166],[16,17,41,42,66,67,92,117,142,167],[18,19,43,44,68,69,93,94,118,119,143,144,168],[20,21,45,46,70,95,120,145,169,170],[22,47,71,72,96,97,121,122,146,171],[23,24,48,73,98,123,147,148,172,173],[25,49,50,74,75,99,100,124,125,149,150,174,175]]
scorerule = [[{0,1},{2,3},{4,5},{6},{7,8},{9,10,11},{12,13},{14},{15,16},{17,18,19,20}],[{0,1,2,3},{4},{5},{6},{7},{8},{9},{10},{11},{12,13}],
             [{0,1,2,3,4,5},{6,7},{8,9},{10,11},{12,13},{14,15,16},{17,18},{19,20},{21,22},{23,24,25,26}],[{0,1,2},{3,4},{5},{6,7},{8,9},{10,11,12},{13,14},{15,16},{17,18},{19,20,21,22,23,24,25,26}],
             [{0,1,2,3},{4},{5,6},{7},{8,9},{10,11,12},{13,14},{15,16},{17,18},{19,20,21,22,23,24,25,26}],[{0,1,2,3,4,5},{6,7},{8,9},{10},{11,12},{13,14},{15,16},{17},{18},{19,20}],
             [{0,1},{2},{3},{4,5,6},{7,8},{9,10,11},{12,13,14},{15,16},{17,18,19},{20,21,22,23,24,25,26}],[{0,1,2,3,4,5},{6},{7,8},{9},{10,11},{12,13},{14},{15,16},{17},{18,19}],
             [{0,1,2,3},{4,5},{6},{7,8},{9,10},{11,12},{13},{14,15},{16},{17,18,19,20}],[{0,1,2,3,4,5},{6,7},{8,9},{10,11},{12,13},{14,15},{16,17},{18,19},{20},{21,22,23,24,25,26}],
             [{0,1,2},{3},{4},{5,6},{7,8},{9,10},{11},{12,13},{14},{15,16,17,18,19,20}],[{0,1,2},{3,4},{5,6},{7,8},{9,10},{11,12},{13,14},{15,16},{17,18},{19,20,21,22,23,24,25,26}],
             [{0,1,2,3,4},{5},{6,7},{8},{9,10},{11,12},{13},{14},{15},{16,17,18,19,20}],[{0,1,2,3,4,5},{6,7},{8},{9,10},{11,12},{13,14},{15},{16,17},{18},{19,20}],
             [{0,1,2,3,4},{5,6},{7,8},{9,10},{11,12},{13,14},{15},{16,17},{18},{19,20}],[{0,1,2},{3,4},{5,6},{7,8},{9,10,11},{12,13,14},{15,16},{17,18,19},{20,21},{22,23,24,25,26}]]

loginfo = [
        {'var_name': 'name', 'label': '姓名', 'default': '张三'},
{'var_name': 'phonenumber', 'label': '手机号', 'default': '12345'},
        {'var_name': 'verifycode', 'label': '验证码', 'default': '123456'}]

